rost0031/STM32491_CPLR/Firmware/Application/src/app/CommMgr.c
            /* Append payload msg if needed */
            switch( me->msgPayloadName ) {
                case _DC3StatusPayloadMsg:
                    evt->dataLen = DC3StatusPayloadMsg_write_delimited_to(
                        (void*)&(me->payloadMsgUnion.statusPayload),
                        evt->dataBuf,
                        evt->dataLen
                    );
                    break;
                case _DC3VersionPayloadMsg:
                    DBG_printf("Sending version payload\n");
                    evt->dataLen = DC3VersionPayloadMsg_write_delimited_to(
                        (void*)&(me->payloadMsgUnion.versionPayload),
                        evt->dataBuf,
                        evt->dataLen
                    );
                    break;
                case _DC3BootModePayloadMsg:
                    DBG_printf("Sending bootMode payload\n");
                    evt->dataLen = DC3BootModePayloadMsg_write_delimited_to(
                        (void*)&(me->payloadMsgUnion.bootmodePayload),
                        evt->dataBuf,
                        evt->dataLen
                    );
                    break;
                case _DC3I2CDataPayloadMsg:
                    DBG_printf("Sending I2CData payload\n");
                    evt->dataLen = DC3I2CDataPayloadMsg_write_delimited_to(
                        (void*)&(me->payloadMsgUnion.i2cDataPayload),
                        evt->dataBuf,
                        evt->dataLen
                    );
                    break;
                case _DC3NoMsg:
                    WRN_printf("Not sending payload as part of Done msg.\n");
                    break;
                case _DC3DbgPayloadMsg:
                    DBG_printf("Sending DC3DbgPayloadMsg payload\n");
                    evt->dataLen = DC3DbgPayloadMsg_write_delimited_to(
                        (void*)&(me->payloadMsgUnion.dbgPayload),
                        evt->dataBuf,
                        evt->dataLen
                    );
                    break;
                default:
                    WRN_printf("Unknown payload detected %d, this is probably an error\n",
                        me->msgPayloadName
                    );
                    break;
            }

            /* Send the Done msg buffer to the client */
            me->errorCode = Comm_sendToClient( evt );
            if ( ERR_NONE != me->errorCode ) {
                WRN_printf("Possible error sending Done, attempting to continue. Error: 0x%08x\n", me->errorCode);
            }

            if ( ERR_NONE != me->errorCode ) {
                WRN_printf("Send Done msg with status: 0x%08x\n", me->errorCode);
            }
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::CommMgr::SM::Active::Busy::COMM_MGR_TIMEOUT} */
        case COMM_MGR_TIMEOUT_SIG: {
            ERR_printf("COMM_MGR_TIMEOUT trying to process %d basic msg, error: 0x%08x\n",
                me->basicMsg._msgName, me->errorCode);
            status_ = Q_TRAN(&CommMgr_Idle);
            break;
        }
        default: {
            status_ = Q_SUPER(&CommMgr_Active);
            break;
        }
    }
    return status_;
}

/**
 * @brief	State that ensures the system stays in the Busy state while processing.
 * This state just self-posts an event to start the msg processing. Its primary
 * reason for existance is to make sure that the state machine ends up inside the
 * busy state for proper error handling (if any occur).
 *
 * @param  [in|out] me: Pointer to the state machine
 * @param  [in|out]  e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::CommMgr::SM::Active::Busy::ValidateMsg} ...........................*/
static QState CommMgr_ValidateMsg(CommMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg} */
        case Q_ENTRY_SIG: {
            QTimeEvt_rearm(                                       /* Re-arm timer on entry */
                &me->commOpTimerEvt,
                SEC_TO_TICKS( LL_MAX_TOUT_SEC_COMM_MSG_VALIDATE_MSG_OP )
            );

            /* Post to self to leave the state and continue processing the rest of the msg */
            QEvt *evt = Q_NEW(QEvt, MSG_PROCESS_SIG);
            QACTIVE_POST(AO_CommMgr, (QEvt *)(evt), AO_CommMgr);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->commOpTimerEvt);                  /* Disarm timer on exit */
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS} */
        case MSG_PROCESS_SIG: {
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[GetBootMode?]} */
            if (_DC3GetBootModeMsg == me->basicMsg._msgName) {
                me->errorCode = ERR_NONE;

                DBG_printf("_DC3GetBootModeMsg decoded, attempting to decode payload (if exists)\n");

                /* Compose Done response.  We can re-use the current structure and it will be used by
                 * the exit action of the parent state to send the msg.  Here, we only set up fields
                 * that are specific to this response. We can also destructively change the payload
                 * name since we are sending a response right after this. */
                me->msgPayloadName = _DC3BootModePayloadMsg;

                /* Don't change the basicMsg name since it should be the same in all cases. */
                me->basicMsg._msgPayload = me->msgPayloadName;
                me->payloadMsgUnion.bootmodePayload._errorCode = me->errorCode;
                me->payloadMsgUnion.bootmodePayload._bootMode  = _DC3_Application; // This is the bootloader
                DBG_printf("Setting bootMode payload with bootmode: %d\n", me->payloadMsgUnion.bootmodePayload._bootMode);
                status_ = Q_TRAN(&CommMgr_Idle);
            }
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[Unsupported?]} */
            else if (_DC3FlashMsg == me->basicMsg._msgName) {
                me->errorCode = ERR_MSG_UNSUPPORTED_IN_APPLICATION;

                status_ = Q_TRAN(&CommMgr_Idle);
            }
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[SetBootMode?]} */
            else if (_DC3SetBootModeMsg == me->basicMsg._msgName) {
                DBG_printf("_DC3SetBootModeMsg decoded, attempting to decode payload (if exists)\n");

                /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[SetBootMode?]::[ValidPayload?]} */
                if (_DC3BootModePayloadMsg == me->msgPayloadName) {
                    /* Has to be set after checking for a valid payload */
                    me->msgPayloadName = _DC3StatusPayloadMsg;
                    me->basicMsg._msgPayload = me->msgPayloadName;
                    /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[SetBootMode?]::[ValidPayload?]::[Application?]} */
                    if (_DC3_Application == me->payloadMsgUnion.bootmodePayload._bootMode) {
                        me->errorCode = ERR_NONE;
                        DBG_printf("Already in Application mode\n");
                        status_ = Q_TRAN(&CommMgr_Idle);
                    }
                    /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[SetBootMode?]::[ValidPayload?]::[Bootloader?]} */
                    else if (_DC3_Bootloader == me->payloadMsgUnion.bootmodePayload._bootMode) {
                        me->errorCode = ERR_NONE;
                        DBG_printf("Resetting system to get back to bootloader mode\n");

                        /* Post to self to boot to application but still have enough time to send a Done */
                        QEvt *evt = Q_NEW(QEvt, BOOT_RESET_SIG);
                        QACTIVE_POST(AO_CommMgr, (QEvt *)(evt), AO_CommMgr);
                        status_ = Q_TRAN(&CommMgr_Idle);
                    }
                    /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[SetBootMode?]::[ValidPayload?]::[else]} */
                    else {
                        me->errorCode = ERR_COMM_INVALID_BOOTMODE_REQUESTED;
                        ERR_printf("Unsupported bootmode requested (%d). Error: 0x%08x\n",
                            me->payloadMsgUnion.bootmodePayload._bootMode, me->errorCode
                        );
                        status_ = Q_TRAN(&CommMgr_Idle);
                    }
                }
                /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[SetBootMode?]::[else]} */
                else {
                    /* Has to be set after checking for a valid payload */
                    me->msgPayloadName = _DC3StatusPayloadMsg;
                    me->basicMsg._msgPayload = me->msgPayloadName;

                    me->errorCode = ERR_MSG_UNEXPECTED_PAYLOAD;
                    ERR_printf(
                        "Invalid payload for SetBootMode.  Expected BootmodePayload (%d), got (%d). Error: 0x%08x\n",
                        _DC3BootModePayloadMsg, me->msgPayloadName, me->errorCode
                    );

                    status_ = Q_TRAN(&CommMgr_Idle);
                }
            }
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[I2CRead?]} */
            else if (_DC3I2CReadMsg == me->basicMsg._msgName) {
                /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[I2CRead?]::[ValidPayload?]} */
                if (_DC3I2CDataPayloadMsg == me->msgPayloadName) {
                    /* Has to be set after checking for a valid payload */
                    me->msgPayloadName = _DC3I2CDataPayloadMsg;
                    me->basicMsg._msgPayload = me->msgPayloadName;

