rost0031/STM32491_CPLR/Firmware/Application/src/app/CommMgr.c
                    /* Create the event and directly post it to the right AO. */
                    I2CReadReqEvt *i2cReadReqEvt  = Q_NEW(I2CReadReqEvt, I2C1_DEV_RAW_MEM_READ_SIG);
                    i2cReadReqEvt->i2cDev         = me->payloadMsgUnion.i2cDataPayload._i2cDev;
                    i2cReadReqEvt->addr           = I2C_getMemAddr( i2cReadReqEvt->i2cDev ) + me->payloadMsgUnion.i2cDataPayload._start;
                    i2cReadReqEvt->bytes          = me->payloadMsgUnion.i2cDataPayload._nBytes;
                    i2cReadReqEvt->accessType     = me->payloadMsgUnion.i2cDataPayload._accType;
                    QACTIVE_POST(AO_I2C1DevMgr, (QEvt *)(i2cReadReqEvt), me);
                    status_ = Q_TRAN(&CommMgr_WaitForRespFromI2C);
                }
                /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[I2CRead?]::[else]} */
                else {
                    me->errorCode = ERR_MSG_UNEXPECTED_PAYLOAD;
                    WRN_printf("Unexpected payload %d for I2CReadMsg. Error: 0x%08x\n",
                        me->msgPayloadName, me->errorCode);
                    status_ = Q_TRAN(&CommMgr_Idle);
                }
            }
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[I2CWrite?]} */
            else if (_DC3I2CWriteMsg == me->basicMsg._msgName) {
                /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[I2CWrite?]::[ValidPayload?]} */
                if (_DC3I2CDataPayloadMsg == me->msgPayloadName) {
                    /* Has to be set after checking for a valid payload */
                    me->msgPayloadName = _DC3StatusPayloadMsg;
                    me->basicMsg._msgPayload = me->msgPayloadName;

                    /* Create the event and directly post it to the right AO. */
                    I2CWriteReqEvt *i2cWriteReqEvt  = Q_NEW(I2CWriteReqEvt, I2C1_DEV_RAW_MEM_WRITE_SIG);
                    i2cWriteReqEvt->i2cDev         = me->payloadMsgUnion.i2cDataPayload._i2cDev;
                    i2cWriteReqEvt->addr           = I2C_getMemAddr( i2cWriteReqEvt->i2cDev ) + me->payloadMsgUnion.i2cDataPayload._start;
                    i2cWriteReqEvt->accessType     = me->payloadMsgUnion.i2cDataPayload._accType;
                    i2cWriteReqEvt->bytes          = me->payloadMsgUnion.i2cDataPayload._nBytes;
                    MEMCPY(
                        i2cWriteReqEvt->dataBuf,
                        me->payloadMsgUnion.i2cDataPayload._dataBuf,
                        me->payloadMsgUnion.i2cDataPayload._dataBuf_len
                    );

                    QACTIVE_POST(AO_I2C1DevMgr, (QEvt *)(i2cWriteReqEvt), me);

                    status_ = Q_TRAN(&CommMgr_WaitForRespFromI2C);
                }
                /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[I2CWrite?]::[else]} */
                else {
                    /* Has to be set after checking for a valid payload */
                    me->msgPayloadName = _DC3StatusPayloadMsg;
                    me->basicMsg._msgPayload = me->msgPayloadName;

                    me->errorCode = ERR_MSG_UNEXPECTED_PAYLOAD;
                    WRN_printf("Unexpected payload %d for I2CWriteMsg. Error: 0x%08x\n",
                        me->msgPayloadName, me->errorCode);
                    status_ = Q_TRAN(&CommMgr_Idle);
                }
            }
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[DbgGetCurrent?]} */
            else if (_DC3DbgGetCurrentMsg == me->basicMsg._msgName) {
                me->errorCode = ERR_NONE;

                DBG_printf("_DC3DbgGetCurrentMsg decoded, attempting to decode payload (if exists)\n");

                /* Compose Done response.  We can re-use the current structure and it will be used by
                 * the exit action of the parent state to send the msg.  Here, we only set up fields
                 * that are specific to this response. We can also destructively change the payload
                 * name since we are sending a response right after this. */
                me->msgPayloadName = _DC3DbgPayloadMsg;

                /* Don't change the basicMsg name since it should be the same in all cases. */
                me->basicMsg._msgPayload = me->msgPayloadName;
                me->payloadMsgUnion.dbgPayload._errorCode = me->errorCode;
                me->payloadMsgUnion.dbgPayload._dbgSettings  = glbDbgConfig;
                DBG_printf("Setting dbgPayload payload with dbgSettings: 0x%08x\n", me->payloadMsgUnion.dbgPayload._dbgSettings);
                status_ = Q_TRAN(&CommMgr_Idle);
            }
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[DbgSetCurrent?]} */
            else if (_DC3DbgSetCurrentMsg == me->basicMsg._msgName) {
                me->errorCode = ERR_NONE;

                DBG_printf("_DC3DbgSetCurrentMsg decoded, attempting to decode payload (if exists)\n");

                /* Compose Done response.  We can re-use the current structure and it will be used by
                 * the exit action of the parent state to send the msg.  Here, we only set up fields
                 * that are specific to this response. We can also destructively change the payload
                 * name since we are sending a response right after this. */
                me->msgPayloadName = _DC3DbgPayloadMsg;

                /* Set the debugging modules bitfield to what was sent over, overwriting all settings.*/
                DBG_SET_DEBUG_FOR_ALL_MODULES( me->payloadMsgUnion.dbgPayload._dbgSettings );

                /* Don't change the basicMsg name since it should be the same in all cases. */
                me->basicMsg._msgPayload = me->msgPayloadName;
                me->payloadMsgUnion.dbgPayload._errorCode = me->errorCode;
                me->payloadMsgUnion.dbgPayload._dbgSettings  = glbDbgConfig;
                DBG_printf("Setting dbgPayload payload with dbgSettings: 0x%08x\n", me->payloadMsgUnion.dbgPayload._dbgSettings);
                status_ = Q_TRAN(&CommMgr_Idle);
            }
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[DC3DbgEnable?]} */
            else if (_DC3DbgEnableMsg == me->basicMsg._msgName) {
                me->errorCode = ERR_NONE;

                DBG_printf("_DC3DbgEnableMsg decoded, attempting to decode payload (if exists)\n");

                /* Compose Done response.  We can re-use the current structure and it will be used by
                 * the exit action of the parent state to send the msg.  Here, we only set up fields
                 * that are specific to this response. We can also destructively change the payload
                 * name since we are sending a response right after this. */
                me->msgPayloadName = _DC3DbgPayloadMsg;

