rost0031/STM32491_CPLR/Firmware/Application/src/app/CommMgr.c
                /* Enable debug module sent over in the message.*/
                DBG_ENABLE_DEBUG_FOR_MODULE( me->payloadMsgUnion.dbgPayload._dbgSettings );

                /* Don't change the basicMsg name since it should be the same in all cases. */
                me->basicMsg._msgPayload = me->msgPayloadName;
                me->payloadMsgUnion.dbgPayload._errorCode = me->errorCode;
                me->payloadMsgUnion.dbgPayload._dbgSettings  = glbDbgConfig;
                DBG_printf("Setting dbgPayload payload with dbgSettings: 0x%08x\n", me->payloadMsgUnion.dbgPayload._dbgSettings);
                status_ = Q_TRAN(&CommMgr_Idle);
            }
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[DC3DbgDisable?]} */
            else if (_DC3DbgDisableMsg == me->basicMsg._msgName) {
                me->errorCode = ERR_NONE;

                DBG_printf("_DC3DbgDisableMsg decoded, attempting to decode payload (if exists)\n");

                /* Compose Done response.  We can re-use the current structure and it will be used by
                 * the exit action of the parent state to send the msg.  Here, we only set up fields
                 * that are specific to this response. We can also destructively change the payload
                 * name since we are sending a response right after this. */
                me->msgPayloadName = _DC3DbgPayloadMsg;

                /* Disable debug module sent over in the message.*/
                DBG_DISABLE_DEBUG_FOR_MODULE( me->payloadMsgUnion.dbgPayload._dbgSettings );

                /* Don't change the basicMsg name since it should be the same in all cases. */
                me->basicMsg._msgPayload = me->msgPayloadName;
                me->payloadMsgUnion.dbgPayload._errorCode = me->errorCode;
                me->payloadMsgUnion.dbgPayload._dbgSettings  = glbDbgConfig;
                DBG_printf("Setting dbgPayload payload with dbgSettings: 0x%08x\n", me->payloadMsgUnion.dbgPayload._dbgSettings);
                status_ = Q_TRAN(&CommMgr_Idle);
            }
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[DC3DbgEnableEth~} */
            else if (_DC3DbgEnableEthMsg == me->basicMsg._msgName) {
                me->errorCode = ERR_NONE;

                DBG_printf("_DC3DbgEnableEthMsg decoded, attempting to decode payload (if exists)\n");

                /* Compose Done response.  We can re-use the current structure and it will be used by
                 * the exit action of the parent state to send the msg.  Here, we only set up fields
                 * that are specific to this response. We can also destructively change the payload
                 * name since we are sending a response right after this. */
                me->msgPayloadName = _DC3StatusPayloadMsg;

                /* Enable debug output over ethernet */
                DBG_ENABLE_DEVICE( _DC3_DBG_DEV_ETH );

                /* Don't change the basicMsg name since it should be the same in all cases. */
                me->basicMsg._msgPayload = me->msgPayloadName;
                me->payloadMsgUnion.statusPayload._errorCode = me->errorCode;

                status_ = Q_TRAN(&CommMgr_Idle);
            }
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[DC3DbgDisableEt~} */
            else if (_DC3DbgDisableEthMsg == me->basicMsg._msgName) {
                me->errorCode = ERR_NONE;

                DBG_printf("_DC3DbgDisableEthMsg decoded, attempting to decode payload (if exists)\n");

                /* Compose Done response.  We can re-use the current structure and it will be used by
                 * the exit action of the parent state to send the msg.  Here, we only set up fields
                 * that are specific to this response. We can also destructively change the payload
                 * name since we are sending a response right after this. */
                me->msgPayloadName = _DC3StatusPayloadMsg;

                /* Disable debug output over ethernet */
                DBG_DISABLE_DEVICE( _DC3_DBG_DEV_ETH );

                /* Don't change the basicMsg name since it should be the same in all cases. */
                me->basicMsg._msgPayload = me->msgPayloadName;
                me->payloadMsgUnion.statusPayload._errorCode = me->errorCode;

                status_ = Q_TRAN(&CommMgr_Idle);
            }
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[DC3DbgEnableSer~} */
            else if (_DC3DbgEnableSerMsg == me->basicMsg._msgName) {
                me->errorCode = ERR_NONE;

                DBG_printf("_DC3DbgEnableSerMsg decoded, attempting to decode payload (if exists)\n");

                /* Compose Done response.  We can re-use the current structure and it will be used by
                 * the exit action of the parent state to send the msg.  Here, we only set up fields
                 * that are specific to this response. We can also destructively change the payload
                 * name since we are sending a response right after this. */
                me->msgPayloadName = _DC3StatusPayloadMsg;

                /* Enable debug output over serial */
                DBG_ENABLE_DEVICE( _DC3_DBG_DEV_SER );

                /* Don't change the basicMsg name since it should be the same in all cases. */
                me->basicMsg._msgPayload = me->msgPayloadName;
                me->payloadMsgUnion.statusPayload._errorCode = me->errorCode;

                status_ = Q_TRAN(&CommMgr_Idle);
            }
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[DC3DbgDisableSe~} */
            else if (_DC3DbgDisableSerMsg == me->basicMsg._msgName) {
                me->errorCode = ERR_NONE;

                DBG_printf("_DC3DbgDisableSerMsg decoded, attempting to decode payload (if exists)\n");

                /* Compose Done response.  We can re-use the current structure and it will be used by
                 * the exit action of the parent state to send the msg.  Here, we only set up fields
                 * that are specific to this response. We can also destructively change the payload
                 * name since we are sending a response right after this. */
                me->msgPayloadName = _DC3StatusPayloadMsg;

                /* Enable debug output over serial */
                DBG_DISABLE_DEVICE( _DC3_DBG_DEV_SER );

                /* Don't change the basicMsg name since it should be the same in all cases. */
                me->basicMsg._msgPayload = me->msgPayloadName;
                me->payloadMsgUnion.statusPayload._errorCode = me->errorCode;

                status_ = Q_TRAN(&CommMgr_Idle);
            }
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[else]} */
            else {
                me->errorCode = ERR_MSG_UNKNOWN_BASIC;
                ERR_printf(
                    "Unknown msg (%d) with msgId=%d. Sending back error: 0x%08x\n",
                    me->basicMsg._msgName, me->msgId, me->errorCode);

                /* Compose Done response.  We can re-use the current structure and it will be used by
                 * the exit action of the parent state to send the msg.  Here, we only set up fields
                 * that are specific to this response. We can also destructively change the payload
                 * name since we are sending a response right after this. */
                me->msgPayloadName = _DC3StatusPayloadMsg;

                /* Don't change the basicMsg name since we don't actually know what it is but add a
                 * status payload msg to let the user know the error. */
                me->basicMsg._msgPayload = me->msgPayloadName;
                me->payloadMsgUnion.statusPayload._errorCode = me->errorCode;



                status_ = Q_TRAN(&CommMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&CommMgr_Busy);
            break;
        }
    }
    return status_;
}

/**
 * @brief    State that waits for a response from I2C1DevMgr AO.
 *
 * @param  [in|out] me: Pointer to the state machine
 * @param  [in|out]  e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::CommMgr::SM::Active::Busy::WaitForRespFromI~} .....................*/
static QState CommMgr_WaitForRespFromI2C(CommMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::CommMgr::SM::Active::Busy::WaitForRespFromI~} */
        case Q_ENTRY_SIG: {
            QTimeEvt_rearm(                                       /* Re-arm timer on entry */
                &me->commOpTimerEvt,
                SEC_TO_TICKS( HL_MAX_TOUT_SEC_CLI_WAIT_FOR_SIMPLE_MSG_DONE )
            );

