rost0031/STM32491_CPLR/Firmware/Application/src/app/CommMgr.c
            me->errorCode = ERR_COMM_I2C_READ_CMD_TIMEOUT; /* Set the error in case we timeout */
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::CommMgr::SM::Active::Busy::WaitForRespFromI~} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->commOpTimerEvt);                  /* Disarm timer on exit */

            if ( ERR_NONE != me->errorCode ) {
                ERR_printf("Leaving state with error: 0x%08x\n", me->errorCode);
            }
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::CommMgr::SM::Active::Busy::WaitForRespFromI~::COMM_OP_TIMEOUT} */
        case COMM_OP_TIMEOUT_SIG: {
            ERR_printf("COMM_OP_TIMEOUT trying to process %d basic msg, error: 0x%08x\n",
                me->basicMsg._msgName, me->errorCode);
            status_ = Q_TRAN(&CommMgr_Idle);
            break;
        }
        /* ${AOs::CommMgr::SM::Active::Busy::WaitForRespFromI~::I2C1_DEV_READ_DO~} */
        case I2C1_DEV_READ_DONE_SIG: {
            me->errorCode = ((I2CReadDoneEvt const *) e)->status;
            if ( ERR_NONE == me->errorCode ) {
                DBG_printf("Got I2C1_DEV_READ_DONE with %d bytes\n", ((I2CReadDoneEvt const *) e)->bytes);
                me->payloadMsgUnion.i2cDataPayload._dataBuf_len = ((I2CReadDoneEvt const *) e)->bytes;
                MEMCPY(
                    me->payloadMsgUnion.i2cDataPayload._dataBuf,
                    ((I2CReadDoneEvt const *) e)->dataBuf,
                    me->payloadMsgUnion.i2cDataPayload._dataBuf_len
                );
            }

            me->payloadMsgUnion.i2cDataPayload._errorCode = me->errorCode;
            status_ = Q_TRAN(&CommMgr_Idle);
            break;
        }
        /* ${AOs::CommMgr::SM::Active::Busy::WaitForRespFromI~::I2C1_DEV_WRITE_D~} */
        case I2C1_DEV_WRITE_DONE_SIG: {
            me->errorCode = ((I2CWriteDoneEvt const *) e)->status;
            if ( ERR_NONE == me->errorCode ) {
                DBG_printf("Got I2C1_DEV_WRITE_DONE with %d bytes\n", ((I2CWriteDoneEvt const *) e)->bytes);
            }

            me->payloadMsgUnion.statusPayload._errorCode = me->errorCode;
            status_ = Q_TRAN(&CommMgr_Idle);
            break;
        }
        default: {
            status_ = Q_SUPER(&CommMgr_Busy);
            break;
        }
    }
    return status_;
}


/**
 * @} end addtogroup groupComm
 */

/******** Copyright (C) 2014 Datacard. All rights reserved *****END OF FILE****/
